export type ViscosityPrecisionItem = {
  name: string
  d: (value: number) => number
  r: (value: number) => number
}

export const viscosityPrecisionData: ViscosityPrecisionItem[] = [
  {
    name: "Базовые масла при 40 °С и 100 °С",
    d: (y) => 0.002 * y,
    r: (x) => 0.0011 * x,
  },
  {
    name: "Компаундированные масла при 40 °С и 100 °С",
    d: (y) => 0.0013 * y,
    r: (x) => 0.0026 * x,
  },
  {
    name: "Компаундированные масла при 150 °С",
    d: (y) => 0.015 * y,
    r: (x) => 0.0056 * x,
  },
  {
    name: "Нефтяные парафины при 100 °С",
    d: (y) => 0.008 * y,
    r: (x) => 0.0141 * x,
  },
  {
    name: "Остаточные жидкие топлива (мазуты) при 80 °С и 100 °С",
    d: (y) => 0.011 * y + 8,
    r: (x) => 0.013 * x + 8,
  },
  {
    name: "Остаточные нефтяные топлива (мазуты) поточные) при 50 °С",
    d: (y) => 0.017 * y,
    r: (x) => 0.015 * x,
  },
  {
    name: "Присадки к смазочным материалам при 100 °С",
    d: (y) => 0.00106 * Math.pow(y, 1.1),
    r: (x) => 0.00192 * Math.pow(x, 1.1),
  },
  {
    name: "Газойли при 40 °С",
    d: (y) => 0.0013 * (y + 1),
    r: (x) => 0.0043 * (x + 1),
  },
  {
    name: "Керосины при минус 20 °С",
    d: (y) => 0.0018 * y,
    r: (x) => 0.007 * x,
  },
  {
    name: "Прочие нефтепродукты",
    d: (y) => 0.002 * y,
    r: (y) => 0.0035 * y,
  },
]
